# Curated Homebrew dependencies for this dotfiles setup.
# Keep this list minimal and intentional.
# Homebrew itself and opencode are installed via external curl scripts.

# Relevant taps
# No extra third-party taps are required for this curated set.

# Dotfiles/bootstrap
brew "stow"
brew "git"
brew "bash"
brew "curl"

# Terminal/editor
brew "neovim"
brew "tmux"
brew "starship"
brew "neofetch"

# Container/dev runtime
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"

# Dev tooling
brew "go"
brew "k6"
brew "kubectx"

# CLI utilities used in shell/editor workflows
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "jq"
brew "ripgrep"
brew "tree"
brew "zoxide"

# Zsh plugins configured in ~/.zshrc
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# GUI apps
cask "ghostty"
cask "legcord"
